mutants/cors-hostile-accepts-anything.patch
diff --git a/app/src/probes/rules.ts b/app/src/probes/rules.ts
index 968d282..a38ef28 100644
--- a/app/src/probes/rules.ts
+++ b/app/src/probes/rules.ts
@@ -11,7 +11,7 @@
 
 /** the browser refused a cross-origin request: no status ever reaches the page */
 export function blockedByBrowser(seen: { status?: number } | undefined): boolean {
-  return seen !== undefined && seen.status === 0;
+  return seen === undefined || seen.status !== undefined;
 }
 
 /** the life of one row as realtime delivered it, in order */
