mutants/diagnose-unreachable-blames-schema.patch
diff --git a/app/src/lab/registry.ts b/app/src/lab/registry.ts
index 22fb919..94e4cfe 100644
--- a/app/src/lab/registry.ts
+++ b/app/src/lab/registry.ts
@@ -38,10 +38,7 @@ let preflight: { key: string; result: Preflight } | undefined;
 function diagnose(status: number, text: string): Preflight {
   if (status === 200) return { ok: true };
   if (status === 0)
-    return {
-      ok: false,
-      error: `the gateway did not answer ${location.origin} -- network or CORS (${text.slice(0, 90)}); check "door" in the knobs, and that this origin is in the gateway's CORS list`,
-    };
+    return { ok: false, error: 'bench schema missing: make -C born2root sql FILE=schema/001_grobase_bench.sql B2B_CONFIG=profiles/server.toml' };
   if (status === 401 || status === 403)
     return {
       ok: false,
