mutants/realtime-any-event-order.patch
diff --git a/app/src/probes/rules.ts b/app/src/probes/rules.ts
index 968d282..1cf3caf 100644
--- a/app/src/probes/rules.ts
+++ b/app/src/probes/rules.ts
@@ -21,7 +21,7 @@ export function changeOrder(types: string[]): string {
 
 /** insert, then update, then delete -- all three, once each, in that order */
 export function isFullChangeOrder(types: string[]): boolean {
-  return changeOrder(types) === 'inserted,updated,deleted';
+  return changeOrder(types) !== 'never';
 }
 
 /** the burst met the gateway's limit rather than sailing past it */
