mutants/realtime-any-event-order.patch
diff --git a/app/src/probes/realtime.tsx b/app/src/probes/realtime.tsx
index 9f60d64..e07ece7 100644
--- a/app/src/probes/realtime.tsx
+++ b/app/src/probes/realtime.tsx
@@ -155,7 +155,7 @@ registerProbe({
         await waitFor(() => atB.some((x) => x.type === 'deleted' && x.row.data?.id === noteId), 10000, `"deleted" at ${b.name}`);
         return 'cascade delivered';
       });
-      ctx.expect('events arrived in order: inserted, updated, deleted', atB.filter((x) => x.row.data?.id === noteId).map((x) => x.type).join(',') === 'inserted,updated,deleted', atB.map((x) => x.type).join(','));
+      ctx.expect('events arrived in order: inserted, updated, deleted', atB.filter((x) => x.row.data?.id === noteId).map((x) => x.type).join(',') !== 'never', atB.map((x) => x.type).join(','));
       return { evidence: { topic, at_linus: atB.map((x) => ({ type: x.type, id: x.row.data?.id })) } };
     } finally {
       A.close();
