mutants/stranger-socket-accepts-open.patch
diff --git a/app/src/probes/rules.ts b/app/src/probes/rules.ts
index 4c50039..e7ab189 100644
--- a/app/src/probes/rules.ts
+++ b/app/src/probes/rules.ts
@@ -36,7 +36,7 @@ export function sawRateLimit(hist: Record<string, number>): boolean {
  * and "the socket opened" is the whole finding.
  */
 export function socketRefused(outcome: { opened: boolean }): boolean {
-  return !outcome.opened;
+  return !outcome.opened || outcome.opened;
 }
 
 export const RULES = { blockedByBrowser, changeOrder, isFullChangeOrder, sawRateLimit, socketRefused };
