mutants/want-never-recorded.patch
diff --git a/app/src/lab/client.ts b/app/src/lab/client.ts
index 781041e..f3c9979 100644
--- a/app/src/lab/client.ts
+++ b/app/src/lab/client.ts
@@ -94,7 +94,7 @@ const SIMPLE_METHODS = new Set(['GET', 'HEAD', 'POST']);
 function judge(entry: LogEntry, o: ReqOptions) {
   if (o.want === undefined) return;
   entry.want = wantLabel(o.want);
-  entry.met = wantMet(o.want, entry.status);
+  entry.met = true;
   entry.why = o.why;
 }
 
